webservices/soap-over-jms/example/signature_only/request.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1">
			<ds:Signature
				xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-05e1cc1c-e068-42fe-ab45-43db4abb86c6">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces
							xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="SOAP-ENV"/>
						</ds:CanonicalizationMethod>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<ds:Reference URI="#id-2af31830-3ae6-4e00-a94a-0cbe8067ac47">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
									<ec:InclusiveNamespaces
										xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/>
									</ds:Transform>
								</ds:Transforms>
								<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
								<ds:DigestValue>eLgbPEAwFgsJegbDs4e30iI7k/k=</ds:DigestValue>
							</ds:Reference>
						</ds:SignedInfo>
						<ds:SignatureValue>1U7TjGzkODA177Q0x79NUvAw7i9c+zIemguzGgq2YiCgklfhHUk+pXvenEvGO9IRXVlYJU9vsIxN9pvqvg1m3nOxexZcPPRa2Tu4Wuxs4Ysv4NQbcCSJCamrq+xEAIvDT664yW1sBXGBdFgnRYfKsy/ZZX8rBVDGrWbBdQt9b3HFgy5gUgRt2DlsexvltxVs680TJGNOVAEo4lOk9sAl2QsD2zVoC+Jh7B405erLkBdQDonoLGHLPviGljzBot77dm23W3QHFAMJsQFFHNuOQBwP92a6WKI6+EGCQUQRVr4qnJ4NlaQyRxBEG9wjrfXPBNi6Fw3IQnO2wXSKIZexvQ==</ds:SignatureValue>
						<ds:KeyInfo Id="KI-d8be30e6-dd0e-4fed-85dc-6832284b00a7">
							<wsse:SecurityTokenReference wsu:Id="STR-5a2fe624-35fd-4182-aae3-8d6decb3e4dc">
								<ds:X509Data>
									<ds:X509IssuerSerial>
										<ds:X509IssuerName>CN=manoj periathambi,OU=staffing,O=randstad,L=charllote,ST=nc,C=us</ds:X509IssuerName>
										<ds:X509SerialNumber>44181594</ds:X509SerialNumber>
									</ds:X509IssuerSerial>
								</ds:X509Data>
							</wsse:SecurityTokenReference>
						</ds:KeyInfo>
					</ds:Signature>
				</wsse:Security>
			</SOAP-ENV:Header>
			<SOAP-ENV:Body
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2af31830-3ae6-4e00-a94a-0cbe8067ac47">
				<ns2:getBeerRequest
					xmlns:ns2="http://memorynotfound.com/beer">
					<ns2:id>2</ns2:id>
				</ns2:getBeerRequest>
			</SOAP-ENV:Body>
		</SOAP-ENV:Envelope>